In [1]:
%load_ext sql

In [2]:
%sql sqlite:///stud.db

**personal_details table**

In [3]:
%%sql CREATE TABLE personal_details (
    national_ID INTEGER(15),
    stud_ID VARCHAR(15),
    stud_name VARCHAR(100),
    phone_number VARCHAR(15),
    age INTEGER,
    gender VARCHAR(10),
    PRIMARY KEY(national_ID)
    );

 * sqlite:///stud.db
Done.

[]

In [7]:
%%sql INSERT INTO personal_details (national_ID, stud_ID, stud_name, phone_number, age, gender)VALUES
("344534","stud101","Hermione Granger" ,"0712345678",20,"Male"),
("379683","stud102","Draco Malfo" ,"0723456781",21,"Female"),
("347403","stud103","Jayden Wamashati" ,"0734567812",22,"Male"),
("377302","stud104","Ron Weasley" ,"0745678123",19,"Female"),
("336741","stud105","Dolores Umbridge" ,"0756781234",21,"Male"),
("307243","stud106","Hedwig Tonks" ,"0767812345",21,"Female"),
("310932","stud107","Chao Chang" ,"0778123456",22,"Male"),
("343920","stud108","Curfew Yaeitpm" ,"0781234567",20,"Female"),
("345261","stud109","Chaptr Mukenya" ,"0722345678",20,"Male"),
("339152","stud110","Natalie Mpema" ,"0733456781",21,"Female"),
("339746","stud111","Crew Nundi" ,"0744567812",20,"Male"),
("336373","stud112","Bandi Kagunda" ,"0755678123",22,"Female"),
("325252","stud113","Testimony Omolo" ,"0766456781",21,"Male"),
("321746","stud114","Career Mpya" ,"0741367812",20,"Male"),
("390234","stud115","Deamon Anduro" ,"0744421123",22,"Female");

 * sqlite:///stud.db
15 rows affected.

[]

In [8]:
%sql SELECT * FROM personal_details;

 * sqlite:///stud.db
Done.

[(344534, 'stud101', 'Hermione Granger', '0712345678', 20, 'Male'),
 (379683, 'stud102', 'Draco Malfo', '0723456781', 21, 'Female'),
 (347403, 'stud103', 'Jayden Wamashati', '0734567812', 22, 'Male'),
 (377302, 'stud104', 'Ron Weasley', '0745678123', 19, 'Female'),
 (336741, 'stud105', 'Dolores Umbridge', '0756781234', 21, 'Male'),
 (307243, 'stud106', 'Hedwig Tonks', '0767812345', 21, 'Female'),
 (310932, 'stud107', 'Chao Chang', '0778123456', 22, 'Male'),
 (343920, 'stud108', 'Curfew Yaeitpm', '0781234567', 20, 'Female'),
 (345261, 'stud109', 'Chaptr Mukenya', '0722345678', 20, 'Male'),
 (339152, 'stud110', 'Natalie Mpema', '0733456781', 21, 'Female'),
 (339746, 'stud111', 'Crew Nundi', '0744567812', 20, 'Male'),
 (336373, 'stud112', 'Bandi Kagunda', '0755678123', 22, 'Female'),
 (325252, 'stud113', 'Testimony Omolo', '0766456781', 21, 'Male'),
 (321746, 'stud114', 'Career Mpya', '0741367812', 20, 'Male'),
 (390234, 'stud115', 'Deamon Anduro', '0744421123', 22, 'Female')]

**school_details table**

In [11]:
%%sql CREATE TABLE school_details (
  stud_ID VARCHAR(15),
  current_home_county VARCHAR(20),
  secondary_school_county VARCHAR(20),
  residence VARCHAR(15),
  stud_email VARCHAR(50),
  PRIMARY KEY (stud_ID)
);

 * sqlite:///stud.db
Done.

[]

In [12]:
%%sql INSERT INTO school_details(stud_ID)
SELECT stud_ID
FROM personal_details;

 * sqlite:///stud.db
15 rows affected.

[]

In [13]:
%%sql UPDATE school_details
SET stud_email = (SELECT REPLACE (stud_name,' ','')||'@zinduaschool.ac'
FROM personal_details
WHERE school_details.stud_ID = personal_details.stud_ID)

 * sqlite:///stud.db
15 rows affected.

[]

In [14]:
%%sql
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud101";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud102";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud103";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud104";
UPDATE school_details SET current_home_county="Nyamira", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud105";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud106";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud107";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Mombasa", residence="Out of school" WHERE stud_ID="stud108";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud109";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud110";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Turkana", residence="In school" WHERE stud_ID="stud111";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud112";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Taita Taveta", residence="In school" WHERE stud_ID="stud113";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud114";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud115";

 * sqlite:///stud.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [15]:
%sql SELECT * FROM school_details;

 * sqlite:///stud.db
Done.

[('stud101', 'Nakuru', 'Nairobi', 'In school', 'HermioneGranger@zinduaschool.ac'),
 ('stud102', 'Nairobi', 'Nakuru', 'In school', 'DracoMalfo@zinduaschool.ac'),
 ('stud103', 'Samburu', 'Nairobi', 'Out of school', 'JaydenWamashati@zinduaschool.ac'),
 ('stud104', 'Kericho', 'Nairobi', 'In school', 'RonWeasley@zinduaschool.ac'),
 ('stud105', 'Nyamira', 'Nakuru', 'In school', 'DoloresUmbridge@zinduaschool.ac'),
 ('stud106', 'Kisumu', 'Nairobi', 'Out of school', 'HedwigTonks@zinduaschool.ac'),
 ('stud107', 'Nakuru', 'Nairobi', 'Out of school', 'ChaoChang@zinduaschool.ac'),
 ('stud108', 'Kisumu', 'Mombasa', 'Out of school', 'CurfewYaeitpm@zinduaschool.ac'),
 ('stud109', 'Kericho', 'Mombasa', 'In school', 'ChaptrMukenya@zinduaschool.ac'),
 ('stud110', 'Nakuru', 'Mombasa', 'In school', 'NatalieMpema@zinduaschool.ac'),
 ('stud111', 'Kiambu', 'Turkana', 'In school', 'CrewNundi@zinduaschool.ac'),
 ('stud112', 'Nairobi', 'Nakuru', 'In school', 'BandiKagunda@zinduaschool.ac'),
 ('stud113', 'Samburu', 'Taita Taveta', 'In school', 'TestimonyOmolo@zinduaschool.ac'),
 ('stud114', 'Kericho', 'Nairobi', 'Out of school', 'CareerMpya@zinduaschool.ac'),
 ('stud115', 'Kiambu', 'Mombasa', 'In school', 'DeamonAnduro@zinduaschool.ac')]

**contact_details**

In [16]:
%%sql CREATE TABLE contact_details (
    stud_email VARCHAR(50),
    phone_number VARCHAR(15),
    next_of_kin_name VARCHAR(50),
    next_of_kin_relation VARCHAR(10),
    next_of_kin_contacts VARCHAR(13),
    PRIMARY KEY(stud_email)
);

 * sqlite:///stud.db
Done.

[]

In [17]:
%%sql INSERT INTO contact_details (phone_number, next_of_kin_name, next_of_kin_relation, next_of_kin_contacts)VALUES
("0712345678","Darius Young","Father","0782382383"),
("0723456781","Lucy Nderitu","Mother","0723238983"),
("0734567812","Jerotich Koech","Mother","0779343126"),
("0745678123","Mwaura Mwangi","Father","0798246347"),
("0756781234","Ian Patrick","Father","0711234453"),
("0767812345","Lebron James","Father","0765439233"),
("0778123456","Magna Carter","Father","0702526243"),
("0781234567","Cindy Wayne","Mother","0747282839"),
("0722345678","Farah Maalim","Mother","0753927482"),
("0733456781","Faiba Mbugua","Father","0713245748"),
("0744567812","John Doe","Father","0725737383"),
("0755678123","Klaus Michealson","Father","0789346276"),
("0766456781","Suluhu Amdany","Mother","0785739259"),
("0741367812","Daisy Auma","Mother","0791344537"),
("0755421123","Getrude Karen","Mother","0765748244");

 * sqlite:///stud.db
15 rows affected.

[]

In [19]:
%%sql UPDATE contact_details
SET stud_email = (SELECT school_details.stud_email
FROM school_details, personal_details
WHERE school_details.stud_ID = personal_details.stud_ID
AND personal_details.phone_number = contact_details.phone_number);

 * sqlite:///stud.db
15 rows affected.

[]

In [20]:
%sql SELECT * FROM contact_details;

 * sqlite:///stud.db
Done.

[('HermioneGranger@zinduaschool.ac', '0712345678', 'Darius Young', 'Father', '0782382383'),
 ('DracoMalfo@zinduaschool.ac', '0723456781', 'Lucy Nderitu', 'Mother', '0723238983'),
 ('JaydenWamashati@zinduaschool.ac', '0734567812', 'Jerotich Koech', 'Mother', '0779343126'),
 ('RonWeasley@zinduaschool.ac', '0745678123', 'Mwaura Mwangi', 'Father', '0798246347'),
 ('DoloresUmbridge@zinduaschool.ac', '0756781234', 'Ian Patrick', 'Father', '0711234453'),
 ('HedwigTonks@zinduaschool.ac', '0767812345', 'Lebron James', 'Father', '0765439233'),
 ('ChaoChang@zinduaschool.ac', '0778123456', 'Magna Carter', 'Father', '0702526243'),
 ('CurfewYaeitpm@zinduaschool.ac', '0781234567', 'Cindy Wayne', 'Mother', '0747282839'),
 ('ChaptrMukenya@zinduaschool.ac', '0722345678', 'Farah Maalim', 'Mother', '0753927482'),
 ('NatalieMpema@zinduaschool.ac', '0733456781', 'Faiba Mbugua', 'Father', '0713245748'),
 ('CrewNundi@zinduaschool.ac', '0744567812', 'John Doe', 'Father', '0725737383'),
 ('BandiKagunda@zinduaschool.ac', '0755678123', 'Klaus Michealson', 'Father', '0789346276'),
 ('TestimonyOmolo@zinduaschool.ac', '0766456781', 'Suluhu Amdany', 'Mother', '0785739259'),
 ('CareerMpya@zinduaschool.ac', '0741367812', 'Daisy Auma', 'Mother', '0791344537'),
 (None, '0755421123', 'Getrude Karen', 'Mother', '0765748244')]

**financial_details table**

In [21]:
%%sql CREATE TABLE financial_details (
    stud_ID VARCHAR(15),
    stud_name VARCHAR(50),
    sem_fee INTEGER(6),
    fee_paid INTEGER(6),
    PRIMARY KEY(stud_ID)
);

 * sqlite:///stud.db
Done.

[]

In [22]:
%%sql INSERT INTO financial_details(stud_ID, stud_name)
SELECT stud_ID, stud_name
FROM personal_details;

 * sqlite:///stud.db
15 rows affected.

[]

In [23]:
%%sql
UPDATE financial_details SET sem_fee = 25000, fee_paid=25000 WHERE stud_ID = "stud101";
UPDATE financial_details SET sem_fee= 25000, fee_paid=19000 WHERE stud_ID = "stud102";
UPDATE financial_details SET sem_fee= 21900, fee_paid=20000 WHERE stud_ID = "stud103";
UPDATE financial_details SET sem_fee= 22000, fee_paid=22000 WHERE stud_ID = "stud104";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23400 WHERE stud_ID = "stud105";
UPDATE financial_details SET sem_fee= 25000, fee_paid=27000 WHERE stud_ID = "stud106";
UPDATE financial_details SET sem_fee= 24230, fee_paid=21200 WHERE stud_ID = "stud107";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23500 WHERE stud_ID = "stud108";
UPDATE financial_details SET sem_fee= 25000, fee_paid=24500 WHERE stud_ID = "stud109";
UPDATE financial_details SET sem_fee= 25000, fee_paid=25000 WHERE stud_ID = "stud110";
UPDATE financial_details SET sem_fee= 26000, fee_paid=26000 WHERE stud_ID = "stud111";
UPDATE financial_details SET sem_fee= 25000, fee_paid=20900 WHERE stud_ID = "stud112";
UPDATE financial_details SET sem_fee= 25000, fee_paid=22300 WHERE stud_ID = "stud113";
UPDATE financial_details SET sem_fee= 19000, fee_paid=19000 WHERE stud_ID = "stud114";
UPDATE financial_details SET sem_fee= 20800, fee_paid=20800 WHERE stud_ID = "stud115";

 * sqlite:///stud.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [24]:
%sql SELECT * FROM financial_details;

 * sqlite:///stud.db
Done.

[('stud101', 'Hermione Granger', 25000, 25000),
 ('stud102', 'Draco Malfo', 25000, 19000),
 ('stud103', 'Jayden Wamashati', 21900, 20000),
 ('stud104', 'Ron Weasley', 22000, 22000),
 ('stud105', 'Dolores Umbridge', 25000, 23400),
 ('stud106', 'Hedwig Tonks', 25000, 27000),
 ('stud107', 'Chao Chang', 24230, 21200),
 ('stud108', 'Curfew Yaeitpm', 25000, 23500),
 ('stud109', 'Chaptr Mukenya', 25000, 24500),
 ('stud110', 'Natalie Mpema', 25000, 25000),
 ('stud111', 'Crew Nundi', 26000, 26000),
 ('stud112', 'Bandi Kagunda', 25000, 20900),
 ('stud113', 'Testimony Omolo', 25000, 22300),
 ('stud114', 'Career Mpya', 19000, 19000),
 ('stud115', 'Deamon Anduro', 20800, 20800)]

**Create a view for each question, the view name is in the brackets and in italics.
NB: You are to use SQL queries for all of the practice questions below**

**a. Using JOIN get the student names, school id, email, phone number (new_stud_details)**

In [25]:
%%sql CREATE VIEW new_stud_details AS
SELECT pd.stud_name, pd.stud_ID, sd.stud_email, pd.phone_number
FROM personal_details AS pd
JOIN school_details AS sd ON pd.stud_ID = sd.stud_ID;

 * sqlite:///stud.db
Done.

[]

In [26]:
%sql SELECT * FROM new_stud_details;

 * sqlite:///stud.db
Done.

[('Hermione Granger', 'stud101', 'HermioneGranger@zinduaschool.ac', '0712345678'),
 ('Draco Malfo', 'stud102', 'DracoMalfo@zinduaschool.ac', '0723456781'),
 ('Jayden Wamashati', 'stud103', 'JaydenWamashati@zinduaschool.ac', '0734567812'),
 ('Ron Weasley', 'stud104', 'RonWeasley@zinduaschool.ac', '0745678123'),
 ('Dolores Umbridge', 'stud105', 'DoloresUmbridge@zinduaschool.ac', '0756781234'),
 ('Hedwig Tonks', 'stud106', 'HedwigTonks@zinduaschool.ac', '0767812345'),
 ('Chao Chang', 'stud107', 'ChaoChang@zinduaschool.ac', '0778123456'),
 ('Curfew Yaeitpm', 'stud108', 'CurfewYaeitpm@zinduaschool.ac', '0781234567'),
 ('Chaptr Mukenya', 'stud109', 'ChaptrMukenya@zinduaschool.ac', '0722345678'),
 ('Natalie Mpema', 'stud110', 'NatalieMpema@zinduaschool.ac', '0733456781'),
 ('Crew Nundi', 'stud111', 'CrewNundi@zinduaschool.ac', '0744567812'),
 ('Bandi Kagunda', 'stud112', 'BandiKagunda@zinduaschool.ac', '0755678123'),
 ('Testimony Omolo', 'stud113', 'TestimonyOmolo@zinduaschool.ac', '0766456781'),
 ('Career Mpya', 'stud114', 'CareerMpya@zinduaschool.ac', '0741367812'),
 ('Deamon Anduro', 'stud115', 'DeamonAnduro@zinduaschool.ac', '0744421123')]

**b. Create a table with all the details from contacts to school and financial details (full_stud_details)**

In [40]:
%%sql CREATE VIEW full_stud_details AS
SELECT *
FROM school_details AS sd
LEFT JOIN contact_details AS cd ON sd.stud_email = cd.stud_email;

 * sqlite:///stud.db
Done.

[]

In [39]:
%sql DROP VIEW full_stud_details;

 * sqlite:///stud.db
Done.

[]

In [41]:
%sql SELECT * FROM full_stud_details;

 * sqlite:///stud.db
Done.

[('stud101', 'Nakuru', 'Nairobi', 'In school', 'HermioneGranger@zinduaschool.ac', 'HermioneGranger@zinduaschool.ac', '0712345678', 'Darius Young', 'Father', '0782382383'),
 ('stud102', 'Nairobi', 'Nakuru', 'In school', 'DracoMalfo@zinduaschool.ac', 'DracoMalfo@zinduaschool.ac', '0723456781', 'Lucy Nderitu', 'Mother', '0723238983'),
 ('stud103', 'Samburu', 'Nairobi', 'Out of school', 'JaydenWamashati@zinduaschool.ac', 'JaydenWamashati@zinduaschool.ac', '0734567812', 'Jerotich Koech', 'Mother', '0779343126'),
 ('stud104', 'Kericho', 'Nairobi', 'In school', 'RonWeasley@zinduaschool.ac', 'RonWeasley@zinduaschool.ac', '0745678123', 'Mwaura Mwangi', 'Father', '0798246347'),
 ('stud105', 'Nyamira', 'Nakuru', 'In school', 'DoloresUmbridge@zinduaschool.ac', 'DoloresUmbridge@zinduaschool.ac', '0756781234', 'Ian Patrick', 'Father', '0711234453'),
 ('stud106', 'Kisumu', 'Nairobi', 'Out of school', 'HedwigTonks@zinduaschool.ac', 'HedwigTonks@zinduaschool.ac', '0767812345', 'Lebron James', 'Father', '0765439233'),
 ('stud107', 'Nakuru', 'Nairobi', 'Out of school', 'ChaoChang@zinduaschool.ac', 'ChaoChang@zinduaschool.ac', '0778123456', 'Magna Carter', 'Father', '0702526243'),
 ('stud108', 'Kisumu', 'Mombasa', 'Out of school', 'CurfewYaeitpm@zinduaschool.ac', 'CurfewYaeitpm@zinduaschool.ac', '0781234567', 'Cindy Wayne', 'Mother', '0747282839'),
 ('stud109', 'Kericho', 'Mombasa', 'In school', 'ChaptrMukenya@zinduaschool.ac', 'ChaptrMukenya@zinduaschool.ac', '0722345678', 'Farah Maalim', 'Mother', '0753927482'),
 ('stud110', 'Nakuru', 'Mombasa', 'In school', 'NatalieMpema@zinduaschool.ac', 'NatalieMpema@zinduaschool.ac', '0733456781', 'Faiba Mbugua', 'Father', '0713245748'),
 ('stud111', 'Kiambu', 'Turkana', 'In school', 'CrewNundi@zinduaschool.ac', 'CrewNundi@zinduaschool.ac', '0744567812', 'John Doe', 'Father', '0725737383'),
 ('stud112', 'Nairobi', 'Nakuru', 'In school', 'BandiKagunda@zinduaschool.ac', 'BandiKagunda@zinduaschool.ac', '0755678123', 'Klaus Michealson', 'Father', '0789346276'),
 ('stud113', 'Samburu', 'Taita Taveta', 'In school', 'TestimonyOmolo@zinduaschool.ac', 'TestimonyOmolo@zinduaschool.ac', '0766456781', 'Suluhu Amdany', 'Mother', '0785739259'),
 ('stud114', 'Kericho', 'Nairobi', 'Out of school', 'CareerMpya@zinduaschool.ac', 'CareerMpya@zinduaschool.ac', '0741367812', 'Daisy Auma', 'Mother', '0791344537'),
 ('stud115', 'Kiambu', 'Mombasa', 'In school', 'DeamonAnduro@zinduaschool.ac', None, None, None, None, None)]

**d. On the financial_details table add a column, fee_cleared, that has True if student has cleared current fee and False if not (financial_details_view)**

**e. Get the national ID and name of all students who have cleared their fees (fee_cleared)**

In [36]:
%%sql CREATE VIEW fee_cleared AS
SELECT pd.national_ID, fd.stud_name
FROM personal_details AS pd
JOIN financial_details AS fd ON pd.stud_name = fd.stud_name
WHERE fd.fee_paid = fd.sem_fee OR fee_paid > sem_fee;

 * sqlite:///stud.db
Done.

[]

In [37]:
%sql SELECT * FROM fee_cleared;

 * sqlite:///stud.db
Done.

[(344534, 'Hermione Granger'),
 (377302, 'Ron Weasley'),
 (307243, 'Hedwig Tonks'),
 (339152, 'Natalie Mpema'),
 (339746, 'Crew Nundi'),
 (321746, 'Career Mpya'),
 (390234, 'Deamon Anduro')]

**f. Get the total sum of fees paid so far and the total current deficit (total_fee_balance)**

In [ ]:
%%sql CREATE VIEW total_fee_balance AS
SELECT SUM(financial_details.fee_paid) AS total_fee_paid
FROM financial_details
WHERE financial_details.fee_paid = financial_details.sem_fee;

 * sqlite:///stud.db
Done.

[]

In [ ]:
%sql DROP VIEW total_fee_balance;

 * sqlite:///stud.db
(sqlite3.OperationalError) no such view: total_fee_balance
[SQL: DROP VIEW total_fee_balance;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%sql SELECT * FROM total_fee_balance;

 * sqlite:///stud.db
Done.

[(312600,)]

**g. Get the count of students who share a current home county i.e., Say Nairobi, get the number of students whos current_home_county is Nairobi, and so on for all available counties (home_county_count)**

In [ ]:
%%sql CREATE VIEW home_county_count AS
SELECT DISTINCT COUNT(DISTINCT current_home_county)
FROM school_details
WHERE current_home_county LIKE '% %';

 * sqlite:///stud.db
Done.

[]

In [ ]:
%sql DROP VIEW home_county_count;

 * sqlite:///stud.db
Done.

[]

In [ ]:
%sql SELECT * FROM home_county_count;

 * sqlite:///stud.db
Done.

[(0,)]

**h. Get the count of Male and/or Female students from each secondary_school_county (secondary_school_count). The table should contain a column for male student count and female student count for each county.**

**i. Get the percentage of students who set their next_of_kin as Mother vs those that set it as Father1. (kin_percentage)**